In [ ]:
# pip install pandas
import pandas 
import pandas as pd

In [ ]:

#pandas>>data manipulation and data wrangling
# create Series, DataFrame ,indexing, columns, data types, assign, create new columns

# data cleaning
# drop columns,  drop rows, fill missing values, handle outliers, remove duplicates


# data transformation
# pivot, melt, groupby, sort, sortby, rank, quantile, shift,
# data merging
# join, merge, concat, append
# data analysis
# summary statistics, descriptive statistics, correlation, regression, time series analysis
# data visualization
# plot, scatter plot, bar plot, histogram, box plot, violin plot, heatmap
# data export
# to_csv, to_excel, to_json, to_pickle, to_sql



# A Pandas Series is a one-dimensional labeled array-like object that can hold data of any type.
### Labels

# The labels in the Pandas Series are 
# index numbers by default. Like in DataFrame and array, the index number in Series starts from 0.

Data Represent in pandas 

1. Series/1D/Vector

2. DataFrame/2D/Tabular data / Matrix

In [ ]:
# create 
s1 = pd.Series([1, 2, 3, 4, 5])
s1

In [ ]:
type(s1)

In [ ]:
s1.ndim

In [ ]:
s1.shape

In [ ]:
s1.size

In [ ]:
# create sseries with custom index
s2 = pd.Series([6,7,78,9],index=["a","b","c","d"])
s2

In [ ]:
# create series with custom index when value already create
s1
s1.set_axis(["w","x","y","z","v"])

In [ ]:
s1.reset_index(drop=True)

#### Indexing and Slicing

In [ ]:
# indexing
(s1[3])

In [ ]:
s2["c"]

In [ ]:
s2["a":"c"]

In [ ]:
s2[:3]

In [ ]:
# Define DF using 2d array
df = pd.DataFrame([[12,3,34],[3,4,5]])
df

In [ ]:
df.ndim

In [42]:
# Define DF using Dictonary
df2 = pd.DataFrame({"a": [12,3,34] ,
                   "b": [3,4,5]}
                   )
df2

    a  b
0  12  3
1   3  4
2  34  5

In [47]:
df3 = df2.set_axis(["x","y","z"])

In [48]:
df3 = df3.set_axis(["c","d"],axis=1)

In [ ]:
# add new_columns to the dataframe
df2["c"] = [1,2,3]
df2
# https://www.geeksforgeeks.org/adding-new-column-to-existing-dataframe-in-pandas/

    a  b  c
0  12  3  1
1   3  4  2
2  34  5  3

In [50]:
df3

    c  d
x  12  3
y   3  4
z  34  5

In [66]:
df

    0  1   2
0  12  3  34
1   3  4   5

In [84]:
# indxing
# df[0][0,:]

In [85]:
#loc and iloc
#loc is label based indexing cutsom
#iloc is integer based indexing

In [94]:
df3

    c  d
x  12  3
y   3  4
z  34  5

In [96]:
df3.loc["y","c":]

c    3
d    4
Name: y, dtype: int64

In [98]:
df2

    a  b  c
0  12  3  1
1   3  4  2
2  34  5  3

In [ ]:
# 
df2.loc[0:1,"b":]

   b  c
0  3  1
1  4  2

In [105]:
df2.iloc[0:2, 1:]

   b  c
0  3  1
1  4  2

In [106]:
df2.c

0    1
1    2
2    3
Name: c, dtype: int64